In [1]:
import numpy as np
import pandas as pd

## Object creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  3.206741  0.546167  1.063248 -0.139581
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271
2013-01-04  0.544482 -0.070716  0.865140  0.111277
2013-01-05  0.194684  0.533071 -2.236613 -0.873917
2013-01-06  0.278263  1.657618  1.183768  0.811066

In [6]:
df2 = pd.DataFrame({'A': 1.0,
                       'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                       'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## Viewing Data

In [12]:
df.head()

                   A         B         C         D
2013-01-01  3.206741  0.546167  1.063248 -0.139581
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271
2013-01-04  0.544482 -0.070716  0.865140  0.111277
2013-01-05  0.194684  0.533071 -2.236613 -0.873917

In [13]:
df.tail()

                   A         B         C         D
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271
2013-01-04  0.544482 -0.070716  0.865140  0.111277
2013-01-05  0.194684  0.533071 -2.236613 -0.873917
2013-01-06  0.278263  1.657618  1.183768  0.811066

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[ 3.20674081,  0.5461671 ,  1.0632478 , -0.13958073],
       [ 0.69676934,  0.15473944, -0.49499143,  0.68977057],
       [ 1.50558512,  0.4370307 ,  1.08874972,  0.53527067],
       [ 0.54448209, -0.07071602,  0.86513996,  0.11127726],
       [ 0.19468359,  0.53307125, -2.2366131 , -0.87391699],
       [ 0.27826305,  1.65761771,  1.18376771,  0.81106613]])

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   1.071087  0.542985  0.244883  0.188981
std    1.145765  0.596842  1.367720  0.632683
min    0.194684 -0.070716 -2.236613 -0.873917
25%    0.344818  0.225312 -0.154959 -0.076866
50%    0.620626  0.485051  0.964194  0.323274
75%    1.303381  0.542893  1.082374  0.651146
max    3.206741  1.657618  1.183768  0.811066

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    3.206741    0.696769    1.505585    0.544482    0.194684    0.278263
B    0.546167    0.154739    0.437031   -0.070716    0.533071    1.657618
C    1.063248   -0.494991    1.088750    0.865140   -2.236613    1.183768
D   -0.139581    0.689771    0.535271    0.111277   -0.873917    0.811066

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.139581  1.063248  0.546167  3.206741
2013-01-02  0.689771 -0.494991  0.154739  0.696769
2013-01-03  0.535271  1.088750  0.437031  1.505585
2013-01-04  0.111277  0.865140 -0.070716  0.544482
2013-01-05 -0.873917 -2.236613  0.533071  0.194684
2013-01-06  0.811066  1.183768  1.657618  0.278263

In [24]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.544482 -0.070716  0.865140  0.111277
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271
2013-01-05  0.194684  0.533071 -2.236613 -0.873917
2013-01-01  3.206741  0.546167  1.063248 -0.139581
2013-01-06  0.278263  1.657618  1.183768  0.811066

## Filtering

### Getting

In [25]:
df

                   A         B         C         D
2013-01-01  3.206741  0.546167  1.063248 -0.139581
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271
2013-01-04  0.544482 -0.070716  0.865140  0.111277
2013-01-05  0.194684  0.533071 -2.236613 -0.873917
2013-01-06  0.278263  1.657618  1.183768  0.811066

In [26]:
df['A']

2013-01-01    3.206741
2013-01-02    0.696769
2013-01-03    1.505585
2013-01-04    0.544482
2013-01-05    0.194684
2013-01-06    0.278263
Freq: D, Name: A, dtype: float64

In [27]:
df.A

2013-01-01    3.206741
2013-01-02    0.696769
2013-01-03    1.505585
2013-01-04    0.544482
2013-01-05    0.194684
2013-01-06    0.278263
Freq: D, Name: A, dtype: float64

#### Slice rows:

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01  3.206741  0.546167  1.063248 -0.139581
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271

In [29]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271
2013-01-04  0.544482 -0.070716  0.865140  0.111277

#### Selection by label

In [30]:
df.loc['2013-01-01']

A    3.206741
B    0.546167
C    1.063248
D   -0.139581
Name: 2013-01-01 00:00:00, dtype: float64

In [31]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  3.206741  0.546167
2013-01-02  0.696769  0.154739
2013-01-03  1.505585  0.437031
2013-01-04  0.544482 -0.070716
2013-01-05  0.194684  0.533071
2013-01-06  0.278263  1.657618

In [33]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.696769  0.154739
2013-01-03  1.505585  0.437031
2013-01-04  0.544482 -0.070716

In [34]:
df.loc['20130102', ['A','B']]

A    0.696769
B    0.154739
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
df.loc[dates[0], 'A']

3.206740812249794

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

#### Selection by position

In [37]:
df.iloc[3]

A    0.544482
B   -0.070716
C    0.865140
D    0.111277
Name: 2013-01-04 00:00:00, dtype: float64

In [40]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.544482 -0.070716
2013-01-05  0.194684  0.533071

In [41]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.696769  0.154739 -0.494991  0.689771
2013-01-03  1.505585  0.437031  1.088750  0.535271

#### Selection by dtype

In [44]:
df = pd.DataFrame({'string': list('abc'),
                   'int64': list(range(1, 4)),
                   'uint8': np.arange(3, 6).astype('u1'),
                   'float64': np.arange(4.0, 7.0),
                   'bool1': [True, False, True],
                   'bool2': [False, True, False],
                   'dates': pd.date_range('now', periods=3),
                   'category': pd.Series(list("ABC")).astype('category')})
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [43]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

#### Boolean indexing

Take the rows where column `A` is higher than 5

In [46]:
df[df['float64'] >= 5]

,string,int64,uint8,float64,bool1,bool2,dates,category
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [47]:
df2 = df.copy()
df2

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [48]:
df2['E'] = ['one', 'two', 'three']

In [49]:
df2

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2021-11-02 16:49:10.022374,A,one
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B,two
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C,three

use `isin()` to take only rows where `E` is `'one'` or `'two'`

In [50]:
df2[df2['E'].isin(['one','two'])]

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2021-11-02 16:49:10.022374,A,one
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B,two

#### Set values in a dataframe

In [52]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,-1,3,4.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [54]:
df.iat[0,1] = -2
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,-2,3,4.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [55]:
df.iloc[0,1] = 2
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,4.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [56]:
df.at[0,'float64'] = -10
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,-10.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

In [57]:
df.loc[0, 'float64'] = -20
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,3,-20.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,4,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,5,6.0,True,False,2021-11-04 16:49:10.022374,C

Set by assigning a numpy array:

In [59]:
df.loc[:, 'uint8'] = np.array([50] * len(df))
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,50,-20.0,True,False,2021-11-02 16:49:10.022374,A
1,b,2,50,5.0,False,True,2021-11-03 16:49:10.022374,B
2,c,3,50,6.0,True,False,2021-11-04 16:49:10.022374,C